brew "bat"
brew "cmake"
brew "direnv"
brew "fzf"
brew "git-lfs"
brew "git"
brew "go"
brew "httpie"
brew "jq"
brew "neovim"
brew "node"
brew "pigz"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "rust"
brew "tmux"
brew "tree"
brew "uv"
brew "yadm"
brew "zig"
brew "zoxide"
brew "zsh-syntax-highlighting"
cask "discord"
cask "docker"
cask "font-fira-code"
cask "ghostty"
cask "google-cloud-sdk"
cask "orion"
cask "slack"
cask "tailscale"
cask "windows-app"
cask "zoom"
