brew "bat"
brew "direnv"
brew "fzf"
brew "jq"
brew "neovim"
brew "tmux"
brew "tree"
brew "yadm"
brew "zoxide"
brew "zsh-syntax-highlighting"

brew "git"
brew "git-lfs"
brew "gh"

brew "cmake"
brew "pkg-config"

brew "go"

brew "python@3.12"
brew "python@3.13"
brew "poetry"
brew "pyright"
brew "ruff"
brew "httpie"

brew "node"

brew "rust"

cask "discord"
cask "docker"
cask "firefox"
cask "ghostty"
cask "google-cloud-sdk"
cask "keymapp"
cask "slack"
cask "spotify"
cask "tailscale"
cask "windows-app"
cask "zoom"

cask "font-fira-code"
