brew "bat"
brew "cmake"
brew "copilot-language-server"
brew "direnv"
brew "fzf"
brew "git-lfs"
brew "git"
brew "go"
brew "helm"
brew "httpie"
brew "jq"
brew "kubectx"
brew "neovim"
brew "node"
brew "pigz"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "stern"
brew "tmux"
brew "tree"
brew "uv"
brew "watch"
brew "yadm"
brew "zoxide"
brew "zsh-syntax-highlighting"
cask "discord"
cask "docker-desktop"
cask "font-fira-code"
cask "gcloud-cli"
cask "ghostty"
cask "slack"
cask "tailscale-app"
cask "windows-app"
cask "zoom"
